Show / Hide Table of Contents
Class DesignMember
DesignMember
Inheritance
System.Object
OpenObject
OpenElementId
DesignMember
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Common.CheckMember.DesignMember,CI.ServicesCommon", "CI.Common.CheckMember.IDesignMember,CI.BasicTypes")]
public class DesignMember : OpenElementId
Constructors
Improve this Doc   View Source
DesignMember()
Constructor
Declaration
public DesignMember()
Properties
Improve this Doc   View Source
Members
Array of Member1D
Declaration
public List<ReferenceElement> Members { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
List of Member1D
Improve this Doc   View Source
Name
Name of Element
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source